[
  {
    "id": "exp-001",
    "role": "Senior Frontend Developer",
    "company": "trbo",
    "location": "Munich, Bavaria, Germany",
    "period": "Feb 2024 — Present",
    "description": "Contributed to the incremental migration from Angular to React, modernizing the frontend through component refactors and safe, small-step rollouts. Helped introduce Storybook to enable component-driven development and faster, more reliable UI work. Maintain legacy Angular and PHP code while gradually migrating features, and implement CI/CD and testing practices to improve quality. Mentor a junior front-end developer with hands-on guidance and code reviews, and support AI-assisted pair-programming by creating practical guidelines to improve accuracy and productivity. Deliver work iteratively using Scrum/XP/Kanban processes.",
    "technologies": [
      "Vue.js",
      "React",
      "Node.js",
      "Ruby on Rails",
      "TypeScript",
      "PostgreSQL",
      "Redis",
      "Jest",
      "Mocha",
      "Cypress",
      "CircleCI"
    ],
    "isCurrent": true
  },
  {
    "id": "exp-002",
    "role": "Senior Frontend Developer",
    "company": "Chatchamp",
    "location": "Munich, Bavaria, Germany",
    "period": "Feb 2022 — Feb 2024",
    "description": "Contributed to the launch of 'Wizard', a guided product-recommendation product, shaping frontend architecture using Vue.js and Domain-Driven Design to keep the codebase modular and maintainable. Maintained a Ruby on Rails admin panel and built React-based admin UIs when needed. Supported and extended a Node.js backend for the Chatbot/Wizard, integrated WebSockets for real-time user interactions, and used PostgreSQL for persistence. Collaborated with backend engineers to implement AI-powered answers driven by customer knowledge bases via the OpenAI API. Ensured CI/CD, testing, and ongoing maintenance across the product suite.",
    "technologies": [
      "Vue.js",
      "React",
      "Node.js",
      "Ruby on Rails",
      "TypeScript",
      "PostgreSQL",
      "Redis",
      "CircleCI"
    ],
    "isCurrent": false
  },
  {
    "id": "exp-003",
    "role": "Full-stack Developer",
    "company": "Slideworks",
    "location": "São Paulo, Brazil",
    "period": "Dec 2020 — Apr 2022",
    "description": "Maintained and delivered multiple MVPs and client projects as a full-stack developer, building modern web and mobile experiences with React (Next.js), Vue.js (Nuxt.js), and Flutter. Implemented backend APIs with Node.js and Ruby on Rails, managed MySQL databases, and used Docker for containerized development. Advocated test-driven development (TDD) and mobile-first design, and established CI/CD pipelines to speed delivery and improve reliability.",
    "technologies": [
      "React",
      "Next.js",
      "Vue.js",
      "Node.js",
      "Ruby on Rails",
      "TypeScript",
      "MySQL",
      "Docker",
      "Flutter",
      "GitHub Actions",
      "Bitbucket Pipelines"
    ],
    "isCurrent": false
  },
  {
    "id": "exp-004",
    "role": "Full-stack Developer",
    "company": "EFFICI",
    "location": "São Paulo, Brazil",
    "period": "Jan 2020 — Dec 2020",
    "description": "Contributed to migrating a legacy Koa-based system to an Express-based architecture, helping improve maintainability and performance. Built and maintained Node.js backends with MySQL and developed frontend features using Vue.js (Nuxt.js). Supported cloud infrastructure on Google Cloud, containerized services with Docker, and helped maintain CI/CD and deployment pipelines.",
    "technologies": [
      "Node.js",
      "Express",
      "Koa",
      "GraphQL",
      "Vue.js",
      "Nuxt.js",
      "React",
      "MySQL",
      "Docker",
      "Google Cloud",
      "AWS",
      "Bitbucket Pipelines"
    ],
    "isCurrent": false
  }
]
